In [1]:
import pandas as pd
%matplotlib inline
import matplotlib
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('responses.csv')
df.shape

(1010, 150)

In [3]:
phobia = df['Public speaking']
phobia.isna().sum()

2

In [4]:
music = df[['Music', 'Classical music', 'Rock', 'Opera', 'Swing, Jazz']]

In [5]:
music.head()

   Music  Classical music  Rock  Opera  Swing, Jazz
0    5.0              2.0   5.0    1.0          1.0
1    4.0              1.0   5.0    1.0          1.0
2    5.0              4.0   5.0    3.0          3.0
3    5.0              1.0   2.0    1.0          1.0
4    5.0              4.0   3.0    2.0          2.0

In [6]:
music.isna().sum()

Music              3
Classical music    7
Rock               6
Opera              1
Swing, Jazz        6
dtype: int64

In [7]:
music[music.isna().any(axis = 1)]

     Music  Classical music  Rock  Opera  Swing, Jazz
22     5.0              3.0   NaN    2.0          1.0
91     5.0              NaN   5.0    1.0          1.0
103    5.0              NaN   1.0    4.0          4.0
107    5.0              2.0   4.0    NaN          4.0
164    5.0              3.0   NaN    2.0          4.0
167    3.0              NaN   4.0    2.0          3.0
226    5.0              NaN   5.0    1.0          2.0
243    NaN              4.0   5.0    2.0          4.0
347    5.0              2.0   4.0    1.0          NaN
362    5.0              4.0   5.0    4.0          NaN
424    5.0              2.0   NaN    1.0          4.0
441    5.0              2.0   NaN    1.0          1.0
484    5.0              2.0   4.0    2.0          NaN
487    5.0              1.0   1.0    1.0          NaN
524    5.0              4.0   5.0    3.0          NaN
558    NaN              2.0   2.0    2.0          2.0
643    5.0              NaN   5.0    4.0          3.0
756    5.0              NaN   5.0    2.0          3.0
842    NaN              3.0   5.0    1.0          2.0
868    5.0              2.0   NaN    2.0          2.0
887    4.0              NaN   5.0    2.0          2.0
918    4.0              2.0   5.0    3.0          NaN
943    4.0              5.0   NaN    2.0          4.0

In [8]:
music = music.fillna(music.mean())
music.loc[643]

Music              5.000000
Classical music    2.956132
Rock               5.000000
Opera              4.000000
Swing, Jazz        3.000000
Name: 643, dtype: float64

In [9]:
movies = df[['Movies', 'Thriller', 'Comedy', 'Documentary', 'Fantasy/Fairy tales']]

In [10]:
movies.head()

   Movies  Thriller  Comedy  Documentary  Fantasy/Fairy tales
0     5.0       2.0     5.0          3.0                  5.0
1     5.0       2.0     4.0          4.0                  3.0
2     5.0       4.0     4.0          2.0                  5.0
3     5.0       4.0     3.0          5.0                  1.0
4     5.0       4.0     5.0          3.0                  4.0

In [11]:
movies.isna().sum()

Movies                 6
Thriller               1
Comedy                 3
Documentary            8
Fantasy/Fairy tales    3
dtype: int64

In [12]:
movies = movies.fillna(movies.sum())

In [13]:
hobbies = df[['Art exhibitions', 'Science and technology', 'Religion', 'Countryside, outdoors', 'Fun with friends']]

In [14]:
hobbies.head()

,Art exhibitions,Science and technology,Religion,"Countryside, outdoors",Fun with friends
0,1.0,4.0,1.0,5.0,5.0
1,2.0,3.0,1.0,1.0,4.0
2,5.0,2.0,5.0,5.0,5.0
3,5.0,3.0,4.0,1.0,2.0
4,1.0,3.0,4.0,4.0,4.0

In [15]:
hobbies.isna().sum()

Art exhibitions           6
Science and technology    6
Religion                  3
Countryside, outdoors     7
Fun with friends          4
dtype: int64

In [16]:
hobbies = hobbies.fillna(hobbies.mean())

In [17]:
life_views = df[['Personality', 'Assertiveness', 'Workaholism', 'Healthy eating', 'Thinking ahead']]

In [18]:
life_views.head()

   Personality  Assertiveness  Workaholism  Healthy eating  Thinking ahead
0          4.0            1.0          4.0             4.0             2.0
1          3.0            2.0          5.0             3.0             4.0
2          3.0            3.0          3.0             3.0             5.0
3          2.0            5.0          5.0             3.0             3.0
4          3.0            4.0          3.0             4.0             5.0

In [19]:
life_views.isna().sum()

Personality       4
Assertiveness     2
Workaholism       5
Healthy eating    3
Thinking ahead    3
dtype: int64

In [20]:
life_views = life_views.fillna(life_views.mean())

In [21]:
spending = df[['Finances', 'Spending on looks', ]]

In [22]:
spending.head()

   Finances  Spending on looks
0       3.0                3.0
1       3.0                2.0
2       2.0                3.0
3       2.0                4.0
4       4.0                3.0

In [23]:
spending.isna().sum()

Finances             3
Spending on looks    3
dtype: int64

In [24]:
spending = spending.fillna(spending.mean())
spending.head()

   Finances  Spending on looks
0       3.0                3.0
1       3.0                2.0
2       2.0                3.0
3       2.0                4.0
4       4.0                3.0

In [25]:
demographics = df[['Age', 'Weight', 'Village - town', 'Number of siblings']]

In [26]:
demographics.isna().sum()

Age                    7
Weight                20
Village - town         4
Number of siblings     6
dtype: int64

In [34]:
demographics = demographics.fillna(demographics.mean())

Age                   0
Weight                0
Village - town        4
Number of siblings    0
dtype: int64

In [36]:
features = pd.concat([movies, music,hobbies, life_views, spending, demographics], axis = 1 )

In [37]:
features.shape

(1010, 26)

In [42]:
features[features.isna().any(1)]

,Movies,Thriller,Comedy,Documentary,Fantasy/Fairy tales,Music,Classical music,Rock,Opera,"Swing, Jazz",...,Assertiveness,Workaholism,Healthy eating,Thinking ahead,Finances,Spending on looks,Age,Weight,Village - town,Number of siblings
45,5.0,4.0,5.0,5.0,2.0,5.0,4.0,4.0,4.0,3.0,...,4.0,5.0,5.0,5.0,4.0,5.0,27.0,78.0,NaN,1.0
368,5.0,5.0,4526.0,5.0,5.0,5.0,3.0,3.0,3.0,3.0,...,5.0,3.0,4.0,3.0,4.0,3.0,18.0,55.0,NaN,1.0
996,3.0,4.0,4.0,3.0,3.0,5.0,3.0,4.0,1.0,2.0,...,3.0,1.0,4.0,5.0,3.0,3.0,20.0,74.0,NaN,0.0
997,4.0,3.0,5.0,3.0,5.0,5.0,1.0,4.0,1.0,1.0,...,4.0,3.0,3.0,2.0,3.0,2.0,19.0,53.0,NaN,1.0